requestGetFee.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://partnerapi.bankplus.viettel.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <par:process>
            <cmd>MM_CHAIN_TRANSFER</cmd>
            <data>{"username":"partnerchain","password":"8z3HlaBtTtUIrU9NnMkir50aefeX3zPmjPV4PcDyMp0K/cPlKRrAsn5jCvkoZmQleg7fEqr+6QEU9B7zgd1BNEobYJklJy2eXVfdW0/iyV4rq/zgvxJlP9WPW5Ts8yDkXrEU0Qk9u5z6bj08HRbVLd53vZmmqy7jiDZ74feVTnk\u003d","channel_info": {"channel_type": "bank","shop_code": "30808","source": "mobileBanking","acc_no": "2232323","bank_code": "LPB"},"service_code": "MMSERVICEAPI","sender": {"msisdn": "0967806109","name": "967806109","id_no": "Pham Van A"},"receiver": {"msisdn": "0967806109","name": "Doi Quoc D***","id_no": ""},"amount": "50000","trans_content": "hihi","trans_fee": "6688","otp": "","original_order_id": "202309302658192223","original_trans_id": "231004629470142","order_id": "202309302658192223","sum_amount_fee": "16688","fee_type": "0"}</data>
            <signature>PPfoxdnbh3UV9BwPBbrJB4LVuFg5gg4f1F6PzadDsMO2LR94vm/1ZKDKIAyUam1DJFUEH59bWYnjm1tvwP6DhaQTMdMxE0OAN4Z79qkFhDQ2bOMmqs1H2qPJOREVmOzz1r4TDQcvk90HE7dTNjndDZdn/bCmaH+jDzmpD482rv4=</signature>
        </par:process>
    </soapenv:Body>
</soapenv:Envelope>